<template>
  <div ref="myEchart" style="height:100%;width:100%;border-radius:10px;">
    <el-input v-model="txtSelectProvince" type="text" style="display:none;"></el-input>
    <el-input v-model="txtChinaMapDisplayMode" type="text" style="display:none;"></el-input>
  </div>
</template>
<script>
import echarts from 'echarts'
export default {
  name: 'Behavior',
  data () {
    return {
      chart: null
    }
  },
  computed: {
    txtSelectProvince: {
      get () {
        if (this.$store.state.allChartsModule.selectProvince === '') {
          // alert('Nothing is selected.')
          // return '全国'
        } else {
          this.Violations()
        }
        return this.$store.state.allChartsModule.selectProvince
      }
    },
    txtChinaMapDisplayMode: {
      get () {
        if (this.$store.state.allChartsModule.chinaMapDisplayMode === '') {
          // alert('Nothing is selected.')
          // return '全国'
        } else {
          this.Violations()
          if (this.$store.state.allChartsModule.componetResizeCount === 5) {
            var myEvent = new Event('resize')
            window.dispatchEvent(myEvent)
            this.$store.commit('allChartsModule/updateComponetResizeCount', 6)
          }
        }
        return this.$store.state.allChartsModule.chinaMapDisplayMode
      }
    }
  },
  mounted () {
    this.$nextTick(() => {
      this.Violations()
    })
  },
  beforeDestroy () {
    if (!this.chart) {
      return
    }
    this.chart.dispose()
    this.chart = null
  },
  methods: {
    Violations () {
      let provinces = ['北京', '天津', '上海', '重庆', '河北', '山西', '辽宁', '吉林', '黑龙江', '江苏', '浙江', '安徽', '福建', '江西', '山东', '河南', '湖北', '湖南', '广东', '海南', '四川', '贵州', '云南', '陕西', '甘肃', '青海', '台湾', '内蒙古', '广西', '西藏', '宁夏', '新疆', '香港', '澳门', '全国']
      let chairData = [[125, 185, 225, 130, 245, 144], [65, 5, 179, 32, 184, 192], [13, 119, 183, 46, 89, 100], [61, 12, 30, 82, 246, 45], [229, 16, 79, 117, 12, 11], [96, 93, 176, 105, 29, 101], [151, 180, 7, 99, 190, 220], [120, 55, 74, 123, 21, 153], [186, 142, 10, 204, 72, 226], [97, 231, 98, 114, 56, 139], [75, 118, 92, 42, 38, 62], [19, 202, 37, 238, 148, 126], [67, 140, 188, 235, 158, 53], [175, 10, 148, 31, 157, 213], [4, 115, 80, 167, 161, 112], [84, 160, 108, 50, 21, 57], [28, 24, 125, 236, 76, 199], [91, 221, 152, 53, 58, 164], [42, 149, 196, 183, 68, 249], [172, 155, 52, 83, 180, 37], [10, 122, 178, 1, 86, 61], [134, 142, 55, 248, 232, 156], [60, 173, 33, 68, 35, 162], [244, 97, 132, 75, 218, 110], [104, 46, 121, 167, 58, 63], [215, 42, 172, 146, 206, 23], [34, 150, 64, 90, 26, 51], [89, 7, 81, 227, 225, 96], [126, 13, 180, 27, 11, 166], [239, 216, 151, 189, 136, 109], [165, 69, 65, 228, 77, 109], [233, 44, 107, 96, 177, 105], [53, 78, 196, 107, 176, 1], [234, 190, 52, 106, 116, 140], [112, 109, 112, 121, 117, 116]]
      let headerData = [[241, 84, 143, 235, 73, 92], [166, 196, 101, 89, 14, 170], [101, 112, 65, 74, 141, 210], [26, 167, 118, 11, 183, 158], [231, 222, 153, 17, 128, 129], [246, 42, 164, 99, 237, 178], [21, 192, 96, 132, 110, 117], [121, 192, 33, 226, 7, 89], [65, 67, 211, 18, 8, 203], [204, 186, 36, 158, 168, 130], [120, 151, 97, 148, 56, 48], [15, 186, 224, 43, 209, 68], [141, 211, 227, 213, 78, 155], [199, 104, 229, 174, 147, 118], [218, 145, 226, 30, 43, 94], [116, 59, 70, 172, 197, 5], [233, 63, 109, 129, 11, 77], [138, 4, 180, 239, 84, 234], [104, 18, 208, 185, 149, 31], [83, 101, 60, 88, 247, 190], [157, 30, 131, 55, 125, 193], [231, 61, 122, 78, 137, 204], [100, 177, 1, 73, 133, 83], [191, 139, 90, 198, 150, 200], [87, 137, 19, 135, 69, 96], [19, 34, 162, 215, 146, 235], [130, 215, 82, 168, 242, 26], [164, 146, 62, 28, 181, 9], [138, 111, 114, 160, 87, 61], [92, 149, 183, 244, 205, 236], [37, 39, 106, 62, 2, 85], [95, 98, 36, 236, 182, 25], [185, 41, 8, 155, 146, 128], [44, 195, 108, 138, 221, 181], [131, 119, 116, 130, 126, 125]]
      let deskData = [[70, 164, 56, 20, 95, 161], [49, 40, 48, 52, 196, 85], [2, 86, 191, 26, 245, 159], [110, 99, 142, 124, 53, 150], [71, 90, 72, 166, 56, 182], [44, 228, 250, 100, 242, 160], [18, 27, 70, 174, 240, 29], [211, 55, 122, 108, 225, 170], [17, 132, 137, 146, 157, 105], [167, 192, 172, 80, 179, 208], [84, 97, 236, 194, 113, 128], [178, 216, 125, 131, 92, 224], [182, 41, 226, 190, 58, 226], [76, 51, 38, 203, 231, 112], [106, 61, 96, 82, 22, 26], [36, 48, 111, 179, 245, 28], [42, 132, 114, 182, 232, 187], [113, 69, 125, 237, 175, 187], [244, 148, 176, 222, 60, 184], [9, 123, 121, 28, 209, 87], [123, 108, 143, 90, 205, 141], [187, 250, 156, 247, 233, 189], [89, 21, 135, 117, 133, 238], [190, 73, 180, 91, 27, 101], [81, 82, 37, 83, 136, 39], [139, 224, 157, 15, 249, 218], [233, 67, 129, 52, 85, 135], [169, 77, 196, 124, 156, 3], [76, 224, 205, 42, 116, 12], [127, 247, 102, 215, 131, 135], [85, 127, 2, 204, 7, 107], [173, 192, 77, 37, 138, 90], [198, 212, 105, 199, 53, 102], [177, 48, 18, 169, 153, 176], [114, 119, 125, 127, 145, 131]]
      let penData = [[126, 25, 99, 1, 142, 192], [128, 193, 29, 89, 140, 107], [117, 81, 198, 241, 162, 17], [73, 91, 52, 214, 53, 247], [171, 28, 121, 111, 227, 30], [37, 51, 71, 5, 126, 10], [85, 232, 58, 129, 64, 64], [247, 128, 242, 53, 140, 190], [211, 71, 9, 191, 110, 80], [75, 24, 7, 47, 136, 225], [206, 154, 138, 158, 63, 148], [103, 202, 100, 189, 54, 249], [125, 106, 237, 150, 58, 91], [31, 205, 18, 127, 78, 42], [5, 128, 229, 52, 69, 47], [34, 154, 11, 183, 55, 15], [243, 161, 131, 144, 87, 24], [233, 184, 157, 175, 94, 171], [48, 164, 224, 220, 59, 1], [14, 142, 86, 77, 250, 146], [30, 113, 233, 17, 7, 40], [155, 188, 71, 170, 225, 153], [28, 210, 96, 120, 86, 197], [200, 192, 15, 179, 166, 168], [59, 101, 199, 176, 226, 105], [22, 174, 34, 43, 248, 197], [150, 147, 6, 45, 241, 112], [3, 95, 5, 146, 26, 189], [152, 218, 124, 97, 195, 194], [174, 66, 137, 202, 135, 160], [182, 199, 43, 151, 32, 156], [13, 9, 172, 4, 106, 34], [194, 54, 31, 170, 187, 82], [139, 125, 65, 239, 231, 118], [112, 129, 101, 126, 125, 117]]
      let wordData = [[28, 82, 210, 63, 174, 89], [189, 141, 209, 210, 175, 144], [6, 52, 51, 75, 124, 213], [64, 239, 210, 244, 221, 18], [106, 31, 39, 61, 126, 78], [81, 158, 39, 1, 128, 140], [180, 68, 31, 152, 247, 208], [91, 60, 191, 188, 125, 19], [22, 177, 176, 8, 46, 111], [250, 37, 170, 190, 114, 10], [103, 198, 216, 248, 141, 79], [194, 196, 126, 104, 148, 5], [239, 43, 52, 171, 163, 155], [148, 241, 102, 162, 231, 186], [163, 150, 105, 121, 211, 74], [23, 118, 198, 228, 193, 43], [177, 223, 210, 231, 150, 234], [157, 212, 232, 64, 151, 221], [185, 239, 113, 234, 74, 109], [45, 74, 22, 59, 66, 107], [85, 85, 149, 59, 115, 93], [131, 58, 52, 214, 117, 45], [64, 218, 172, 249, 185, 117], [186, 141, 82, 15, 53, 102], [84, 166, 132, 84, 181, 110], [243, 200, 21, 51, 182, 66], [85, 110, 186, 25, 109, 67], [205, 122, 95, 10, 24, 58], [60, 191, 123, 194, 60, 54], [40, 52, 178, 31, 128, 168], [243, 212, 2, 8, 93, 56], [89, 170, 161, 131, 46, 245], [65, 136, 190, 201, 224, 75], [225, 17, 73, 32, 41, 32], [125, 135, 127, 121, 134, 103]]
      let handData = [[192, 30, 103, 66, 29, 77], [126, 59, 137, 24, 14, 138], [7, 93, 11, 87, 239, 233], [114, 158, 64, 137, 96, 206], [175, 110, 16, 226, 117, 29], [244, 185, 177, 41, 138, 101], [155, 84, 190, 61, 177, 207], [238, 29, 83, 55, 83, 132], [171, 215, 191, 247, 61, 134], [88, 52, 206, 80, 5, 198], [222, 75, 164, 107, 249, 91], [205, 64, 117, 167, 206, 66], [174, 104, 171, 75, 74, 84], [156, 82, 156, 52, 88, 194], [195, 76, 148, 118, 22, 132], [68, 201, 47, 181, 100, 123], [80, 163, 193, 229, 162, 61], [203, 54, 27, 204, 143, 212], [243, 233, 112, 186, 36, 29], [80, 130, 148, 137, 50, 211], [136, 149, 49, 42, 60, 66], [244, 33, 233, 10, 39, 55], [235, 92, 192, 79, 143, 20], [174, 229, 82, 11, 1, 145], [22, 51, 175, 198, 185, 223], [2, 83, 73, 17, 211, 193], [128, 221, 27, 235, 212, 101], [95, 237, 141, 131, 196, 124], [70, 21, 78, 127, 97, 170], [211, 130, 7, 71, 110, 202], [37, 32, 178, 56, 35, 36], [127, 213, 223, 186, 228, 132], [224, 73, 76, 78, 184, 232], [66, 140, 167, 94, 43, 238], [144, 114, 122, 112, 112, 135]]
      let turnChairData = [[78, 100, 46, 36, 10, 98], [105, 119, 55, 54, 2, 69], [247, 152, 181, 2, 95, 203], [99, 47, 178, 230, 43, 93], [41, 138, 62, 244, 161, 41], [100, 49, 28, 201, 232, 70], [122, 125, 127, 147, 24, 234], [17, 249, 45, 9, 32, 109], [6, 211, 193, 239, 141, 201], [243, 191, 21, 30, 69, 16], [143, 245, 74, 28, 191, 248], [87, 55, 208, 158, 180, 85], [197, 97, 140, 212, 60, 96], [86, 16, 98, 167, 74, 142], [185, 12, 130, 237, 170, 63], [113, 233, 43, 205, 111, 84], [101, 124, 142, 171, 17, 43], [231, 215, 19, 80, 113, 156], [232, 195, 233, 229, 67, 215], [121, 214, 7, 219, 175, 31], [250, 34, 105, 23, 167, 75], [162, 138, 205, 24, 99, 222], [25, 184, 112, 103, 9, 171], [244, 215, 219, 73, 112, 194], [170, 31, 87, 171, 216, 206], [64, 2, 51, 130, 216, 242], [75, 163, 136, 10, 39, 9], [151, 201, 68, 86, 162, 70], [135, 164, 129, 181, 221, 209], [236, 176, 82, 93, 50, 146], [110, 192, 205, 64, 160, 87], [189, 45, 118, 81, 102, 148], [229, 233, 45, 152, 104, 183], [46, 138, 85, 111, 98, 239], [136, 138, 108, 123, 109, 132]]
      let indexPrince = provinces.indexOf(this.$store.state.allChartsModule.selectProvince)
      let currentChair = []
      currentChair = chairData[indexPrince]
      let currentHeader = []
      currentHeader = headerData[indexPrince]
      let currentDesk = []
      currentDesk = deskData[indexPrince]
      let currentPen = []
      currentPen = penData[indexPrince]
      let currentWord = []
      currentWord = wordData[indexPrince]
      let currentHand = []
      currentHand = handData[indexPrince]
      let currentTurnChair = []
      currentTurnChair = turnChairData[indexPrince]
      if (this.$refs.myEchart !== undefined) {
        let myChart = echarts.init(this.$refs.myEchart)
        window.onresize = myChart.resize
        myChart.setOption({
          graphic: [
            {
              type: 'group',
              right: '10',
              top: 20,
              children: [
                {
                  type: 'text',
                  z: 100,
                  left: 'right',
                  top: 'top',
                  style: {
                    fill: '#C1B974',
                    text: [
                      this.$store.state.allChartsModule.selectProvince + ' '
                    ].join('\n'),
                    textFont: 'bold 20px verdana'
                  }
                }
              ]
            }
          ],
          title: {
            text: '行为',
            top: 15,
            left: 15
          },
          tooltip: {
            trigger: 'axis',
            axisPointer: {
              type: 'line',
              lineStyle: {
                width: 3,
                color: {
                  x: 0,
                  y: 0,
                  x2: 0,
                  y2: 1,
                  colorStops: [{
                    offset: 0, color: 'rgba(255,255,255,0.6)' // 0% 处的颜色
                  }, {
                    offset: 1, color: 'rgba(56,142,174,1)' // 100% 处的颜色
                  }]
                }
              }
            },
            padding: [10, 5, 10, 5],
            backgroundColor: 'rgba(50,50,50,0.8)',
            formatter: function (params, ticket, callback) {
              var htmlStr = ''
              for (var i = 0; i < params.length; i++) {
                var param = params[i]
                var xName = param.name// x轴的名称
                var seriesName = param.seriesName// 图例名称
                var value = param.value// y轴值
                var color = param.color// 图例颜色

                if (i === 0) {
                  htmlStr += xName + '<br/>'// x轴的名称
                }
                if (i === 2 || i === 4 || i === 6) {
                  htmlStr += '<div style="clear:both;float:left;width:100px;" align="left">'
                } else {
                  htmlStr += '<div style="float:left;width:100px;" align="left">'
                }

                // 为了保证和原来的效果一样，这里自己实现了一个点的效果
                htmlStr += '<span style="margin-right:5px;display:inline-block;width:10px;height:10px;border-radius:1.5px;background-color:' + color + ';"></span>'

                // 圆点后面显示的文本
                htmlStr += seriesName + '&nbsp;&nbsp;' + value + '&nbsp;&nbsp;&nbsp;&nbsp;'

                htmlStr += '</div>'
              }
              return htmlStr
            }
          },
          legend: [
            {
              data: ['靠椅', '探头', '趴桌', '转笔', '转椅'],
              top: 45,
              left: '5%',
              itemGap: 13,
              itemWidth: 12,
              itemHeight: 12,
              icon: 'roundRect'
            }, {
              data: ['写字', '举手'],
              top: 70,
              left: '5%',
              itemGap: 13,
              itemWidth: 12,
              itemHeight: 12,
              icon: 'roundRect'
            }
          ],
          grid: {
            x: '10%',
            y: '45%',
            x2: '8%',
            y2: '15%'
          },
          xAxis: {
            type: 'category',
            boundaryGap: false,
            data: ['20.01', '20.02', '20.03', '20.04', '20.05', '20.06'],
            axisTick: {show: false},
            axisLine: {show: false}
          },
          yAxis: {
            type: 'value',
            min: 0,
            max: 250,
            interval: 50,
            axisTick: {show: false},
            axisLine: {show: false}
          },
          series: [
            {
              name: '靠椅',
              type: 'line',
              data: currentChair,
              symbolSize: 0,
              itemStyle: {
                color: '#EBA000'
              },
              showSymbol: false
            },
            {
              name: '探头',
              type: 'line',
              data: currentHeader,
              symbolSize: 0,
              itemStyle: {
                color: '#0083C7'
              },
              showSymbol: false
            },
            {
              name: '趴桌',
              type: 'line',
              data: currentDesk,
              symbolSize: 0,
              itemStyle: {
                color: '#8076D7'
              },
              showSymbol: false
            },
            {
              name: '转笔',
              type: 'line',
              data: currentPen,
              symbolSize: 0,
              itemStyle: {
                color: '#26C58C'
              },
              showSymbol: false
            },
            {
              name: '转椅',
              type: 'line',
              data: currentTurnChair,
              symbolSize: 0,
              itemStyle: {
                color: '#FE436C'
              },
              showSymbol: false
            },
            {
              name: '写字',
              type: 'line',
              data: currentWord,
              symbolSize: 0,
              itemStyle: {
                color: '#3E98FF'
              },
              showSymbol: false
            },
            {
              name: '举手',
              type: 'line',
              data: currentHand,
              symbolSize: 0,
              itemStyle: {
                color: '#11B3BD'
              },
              showSymbol: false
            }
          ]
        })
      }
    }
  }
}
</script>
